--[[

	Holograms / Floating text Script by Meh
	
	Just put in the coordinates you get when standing on the ground, it's above the ground then
	By default, you only see the hologram when you are within 10m of it, to change that, edit the 10.0 infront of the "then"
	The Default holograms are at the Observatory.
	
	If you want to add a line to the hologram, just make a new Draw3DText line with the same coordinates, and edit the vertical offset.
	
	Formatting:
			Draw3DText( x, y, z  vertical offset, "text", font, text size, text size)
			
			
	To add a new hologram, copy paste this example under the existing ones, and put coordinates and text into it.
	
		if #(coords - vector3(X, Y, Z)) < 10.0 then
			Draw3DText( X, Y, Z,  -1.400, "TEXT", 4, 0.1, 0.1)
			Draw3DText( X, Y, Z,  -1.600, "TEXT", 4, 0.1, 0.1)
			Draw3DText( X, Y, Z,  -1.800, "TEXT", 4, 0.1, 0.1)		
		end


]]--

CreateThread(function()
    while true do
		Wait(3)
		local sleep = true
		local plyPed = cache.ped
		local coords = GetEntityCoords(plyPed)
		
		--Newbie info center Hologram No. 1
		if #(coords - vector3(-539.95, -213.01, 40.00)) < 10.0 then
			Draw3DText( -539.95, -213.01, 40.00  -1.100, '歡迎加入\n彌敦道 FIVEM', {255,247,0,250}, 1, 0.1, 0.1)
			Draw3DText( -539.95, -213.01, 40.00  -1.700, '~r~**玩家可以於Discord聯絡新手輔導組，以獲得新手求助以及取得禮品**~s~', {255,247,0,250}, 1, 0.1, 0.1)
			Draw3DText( -539.95, -213.01, 40.00  -2.000, '為確保娛樂性，伺服器定位為選擇性擬真，請各位以規辦事。', {255,247,0,250}, 1, 0.1, 0.1)
			Draw3DText( -539.95, -213.01, 40.00  -2.300, '新道友🍀可到 勞工處 或 Discord「各職業招募版」尋找工作。 ', {255,247,0,250}, 1, 0.1, 0.1)		
			Draw3DText( -539.95, -213.01, 40.00  -2.600, '租車站前往 就業中心', {255,247,0,250}, 1, 0.1, 0.1)	
			Draw3DText( -539.95, -213.01, 40.00  -3.000, '⬆\n⬅                        ➡\n⬇️', {255,247,0,250}, 1, 0.1, 0.1)
			Draw3DText( -539.95, -213.01, 40.00  -3.800, '查看規則與法律        進入政府大樓申請身份證        查看基本操作', {255,247,0,250}, 1, 0.07, 0.07)
			
			Draw3DText( -529.88, -209.36, 39  -0.700, "📋彌敦道一切規則及法律", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -529.88, -209.36, 39  -1.100, "位於Discord「伺服器資訊」分類", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -529.88, -209.36, 39  -1.500, "亦可以到彌敦道的維基頁面 \"wiki.nathanroadrp.hk\"", {255,255,255,255}, 1, 0.1, 0.1)

			Draw3DText( -547.19, -222.24, 44  -1.105, "==============💻彌敦道基本操作==============", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -547.19, -222.24, 44  -1.500, "語音設定: 首先選擇ESC➡️設定➡️語音聊天➡️輸入", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -547.19, -222.24, 44  -1.850, "➡️麥克風開啟(要開啟靈敏度)➡️返回遊戲即可使用 N鍵開始說話", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -547.19, -222.24, 44  -2.300, "按鍵指南:\n[~o~F1~s~] 手機\n[~o~F2~s~] 背包物品欄\n[~o~F5~s~] 服裝設定", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -547.19, -222.24, 44  -3.400, "[~o~F7~s~] 界面設定\n[~o~F10~s~] 觀看在線人數\n[~o~F11~s~] 綁定快捷鍵", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -547.19, -222.24, 44  -4.200, "[~o~ALT~s~] 指向性選單\n[~o~T~s~] 聊天公頻\n[~o~X~s~] 舉高雙手", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -547.19, -222.24, 44  -5.100, "[~o~B~s~] 指向動作\n[~o~P~s~] 打開地圖\n[~o~C~s~] 蹲下\n[~o~ ] ~s~] 服裝選單", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -547.19, -222.24, 44  -6.600, "[~o~Z~s~] 調整說話範圍\n[~o~PGUP / PGDOWN~s~] 公頻上一頁或下一頁", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -547.19, -222.24, 44  -7.200, "[~o~Shift + Y~s~] 無線電選單\n[~o~CAPS~s~] 使用無線電", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -547.19, -222.24, 44  -7.800, "==========================================", {255,255,255,255}, 1, 0.1, 0.1)

			Draw3DText( -549.71, -217.5, 43.5  -1.105, "==============💻彌敦道基本操作==============", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 43.5  -1.520, "- 戴具控制：\n[~o~L~s~] 解 / 鎖上載具\n[~o~K~s~] 繫上 / 解開安全帶", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 43.5  -2.400, "[~o~B~s~] 儀錶板選單\n[~o~←~s~] 方向燈左 [~o~→~s~] 方向燈右", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 43.5  -3.000, "[~o~↓~s~] 關閉方向燈 [~o~I~s~] 開啟車尾箱", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 43.5  -3.900, "部分熱鍵可以於暫停選單更改綁定熱鍵", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 43.5  -4.300, "- 指令:\n尋找職業求助: [/~o~999~s~] [/~o~999ems~s~] [/~o~mechanic~s~] [/~o~reply~s~]", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 43.5  -4.850, "切換載具儀錶板: [/~o~carhudt~s~] 熱鍵綁定選單: [/~o~keybinds~s~] 轉移載具擁有權: [/~o~tv~s~]", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 43.5  -5.250, "發票選單: [/~o~invoices~s~] 大聲公: [/~o~speaker~s~] 車匙管理: [/~o~carmenu~s~]", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 43.5  -5.650, "動作: [/~o~e~s~] [/~o~emotebind~s~] [/~o~walk~s~]", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 43.5  -5.950, "商城: [/~o~mall~s~] 飾品選單: [/~o~props~s~]", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 43.5  -6.800, "詳情位於Discord「伺服器資訊」分類", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 43.5  -7.100, "彌敦道的維基頁面 \"~y~wiki.nathanroadrp.hk~s~\"", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -549.71, -217.5, 44  -7.800, "==========================================", {255,255,255,255}, 1, 0.1, 0.1)

			sleep = false
		end

		if #(coords - vector3(-549.24, -191.79, 38.22)) < 10.0 then
			Draw3DText( -549.24, -191.79, 38.22 - 1.5, "請使用[LEFT ALT]指向職員", {255,255,255,255}, 1, 0.08, 0.08)
			sleep = false
		end

		--Newbie info center Hologram No. 2
		-- if #(coords - vector3(-529.88, -209.36, 38)) < 10.0 then
		-- 	Draw3DText( -529.88, -209.36, 39  -0.700, "📋彌敦道一切規則及法律", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -529.88, -209.36, 39  -1.100, "位於Discord「伺服器資訊」分類", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -529.88, -209.36, 39  -1.500, "亦可以到彌敦道的維基頁面 \"wiki.nathanroadrp.hk\"", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	sleep = false
		-- end	
		
		--Newbie info Rental car 
		-- if #(coords - vector3(-519.24, -265.12, 34)) < 15.0 then
		-- 	Draw3DText( -519.24, -265.12, 38  -1.200, "彌敦道 FIVEM", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -519.24, -265.12, 38  -1.500, "租車站", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -519.24, -265.12, 38  -2.000, "謹記租車要有車牌", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -519.24, -265.12, 38  -2.500, "車輛損傷會增加費用，對車技沒信心可先買保險", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	sleep = false
		-- end	
		
		--Newbie info return car 
		if #(coords - vector3(-494.04, -255.56, 34)) < 20.0 then
			Draw3DText( -494.04, -255.56, 38  -1.200, "彌敦道 FIVEM", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -494.04, -255.56, 38  -1.500, "租用車輛還車點", {255,255,255,255}, 1, 0.1, 0.1)

			Draw3DText( -533.95, -244.74, 38  -1.105, "彌敦道 FIVEM", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -533.95, -244.74, 38  -1.500, "─────────────外快工作─────────────", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -533.95, -244.74, 38  -1.800, "伐木\n釣魚", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -533.95, -244.74, 38  -2.900, "─────────────非法工作─────────────", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -533.95, -244.74, 38  -3.200, "毒品\n打劫", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -533.95, -244.74, 38  -4.000, "──────────────────────────────────────────", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -533.95, -244.74, 38  -4.150, "以上均需成本，建議有正職後才考慮副職。", {255,255,255,255}, 1, 0.1, 0.1)

			Draw3DText( -516.2, -253.92, 37  -1.200, "彌敦道 FIVEM", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -516.2, -253.92, 37  -1.500, "免費租還單車點", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -516.2, -253.92, 37  -2.000, "就業中心位於地圖市中心紫色舉手人偶", {210,20,204,250}, 1, 0.1, 0.1)

			sleep = false
		end	
		
		--Newbie info center Hologram No. 4
		-- if #(coords - vector3(-549.24, -219.82, 38)) < 15.0 then
		-- 	Draw3DText( -547.19, -222.24, 44  -1.105, "==============💻彌敦道基本操作==============", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -547.19, -222.24, 44  -1.500, "語音設定: 首先選擇ESC➡️設定➡️語音聊天➡️輸入", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -547.19, -222.24, 44  -1.850, "➡️麥克風開啟(要開啟靈敏度)➡️返回遊戲即可使用 N鍵開始說話", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -547.19, -222.24, 44  -2.300, "按鍵指南: \n[F1] 綁定快捷鍵\n[Tab] 背包物品欄", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -547.19, -222.24, 44  -3.600, "[F5] 服裝設定\n[T] 遊戲聊天室", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -547.19, -222.24, 44  -4.800, "[F10] 觀看在線人數\n[X] 舉高雙手\n[/ci] 關閉物品庫", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -547.19, -222.24, 44  -5.950, "[B] 指向動作\n[P] 打開地圖\n[C] 蹲下", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -547.19, -222.24, 44  -7.200, "[F8>\'exit\'] 關閉～選單", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -547.19, -222.24, 44  -7.800, "==========================================", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	sleep = false
		-- end		
		-- (有機會被偷竊身上金錢)
		
		--Newbie info center Hologram No. 5
		-- if #(coords - vector3(-549.24, -219.82, 38)) < 15.0 then
		-- 	Draw3DText( -549.71, -217.5, 43.5  -1.105, "==============💻彌敦道基本操作==============", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -549.71, -217.5, 43.5  -1.500, "- 手機： \n [ENTER] 拍照\n 輸入[%pos%]發送GPS位置", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -549.71, -217.5, 43.5  -2.720, "- 戴具控制：\n[U]鍵 開啟及鎖上車門\n[K]鍵 繫上安全帶或解開安全帶", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -549.71, -217.5, 43.5  -3.680, "[B] 載具上開啟載具儀錶板設定", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -549.71, -217.5, 43.5  -4.600, "[←] 方向燈 左\n[→] 方向燈 右\n[↓] 關閉方向燈", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -549.71, -217.5, 43.5  -5.700, "[-] 開啟車尾箱", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	-- Draw3DText( -549.71, -217.5, 43.5  -6.020, "- !注意! - \n 按T鍵填上輸入  /register 可以進行整形", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -549.71, -217.5, 43.5  -6.600, "詳情位於Discord「伺服器資訊」分類", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -549.71, -217.5, 43.5  -6.800, "彌敦道的維基頁面 \"wiki.nathanroadrp.hk\"", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -549.71, -217.5, 44  -7.800, "==========================================", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	sleep = false
		-- end		
		
		--Newbie info center Hologram No. 6
		-- if #(coords - vector3(-523.97, -240.63, 36)) < 15.0 then
		-- 	Draw3DText( -523.97, -240.63, 40  -1.105, "彌敦道 FIVEM", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -523.97, -240.63, 40  -1.500, "─────────────企業牌照系統─────────────", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -523.97, -240.63, 40  -1.800, "- 🍖食物製造及銷售牌照\n生產食品\n現牌照擁有者為時代食堂", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -523.97, -240.63, 40  -2.800, "- 🛠修理牌照\n生產修車包及NOS\n現牌照擁有者為維尼車廠", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -523.97, -240.63, 40  -3.800, "- 🚗 車輛行銷修商牌照\n賣車改車計程車服務\n現牌照擁有者為MOSLEY AUTO", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -523.97, -240.63, 40  -4.800, "- ⚔軍火商牌照\n生產武裝\n現牌照擁有者為Y&N Logistic Incorporated", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -523.97, -240.63, 40  -5.600, "──────────────────────────────────────────", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -523.97, -240.63, 40  -5.900, "如有興趣成為老闆, 請參閱Discord:🈺企業牌照守則及指引", {255,255,255,255}, 1, 0.1, 0.1)
		-- sleep = false
		-- end	
		
		--Newbie info center Hologram No. 7
		-- if #(coords - vector3(-533.95, -244.74, 37)) < 15.0 then
		-- 	Draw3DText( -533.95, -244.74, 38  -1.105, "彌敦道 FIVEM", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -533.95, -244.74, 38  -1.500, "─────────────外快工作─────────────", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -533.95, -244.74, 38  -1.800, "伐木\n釣魚", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -533.95, -244.74, 38  -2.900, "─────────────非法工作─────────────", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -533.95, -244.74, 38  -3.200, "毒品\n打劫", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -533.95, -244.74, 38  -4.000, "──────────────────────────────────────────", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -533.95, -244.74, 38  -4.150, "以上均需成本，建議有正職後才考慮副職。", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	sleep = false
		-- end	
		
		--Newbie info center Hologram No. 8
		-- if #(coords - vector3(-520.5, -246.74, 38)) < 20.0 then
		-- 	Draw3DText( -520.5, -246.74, 38  -1.105, "彌敦道 FIVEM", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -520.5, -246.74, 38  -1.500, "─────────────功能牌照服務─────────────", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -520.5, -246.74, 38  -2.000, "車牌\n考核於車神駕駛學院\n分開筆試及路試", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -520.5, -246.74, 38  -3.200, "槍牌\n需先到槍店購買", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -520.5, -246.74, 38  -4.000, "───────────────────────────────────────", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	sleep = false
		-- end	
		
		--Newbie info center Hologram No. 9
		-- if #(coords - vector3(-530.25, -252.33, 38)) < 20.0 then
		-- 	Draw3DText( -530.25, -252.33, 38  -1.105, "彌敦道 FIVEM", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -530.25, -252.33, 38  -1.500, "─────────────骨骼系統─────────────", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -530.25, -252.33, 38  -1.800, "按「～」查看骨骼狀態，檢查骨骼健康情況", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -530.25, -252.33, 38  -2.200, "受傷會影響步行跑步速度及掉血", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -530.25, -252.33, 38  -2.500, "請到醫院醫治，每次收費250元。", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -530.25, -252.33, 38  -3.000, "───────────────────────────────────────", {255,255,255,255}, 1, 0.1, 0.1)
		--	sleep = false
		-- end	
		
		--Newbie info return bicycle
		-- if #(coords - vector3(-516.2, -253.92, 37)) < 10.0 then
		-- 	Draw3DText( -516.2, -253.92, 37  -1.200, "彌敦道 FIVEM", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -516.2, -253.92, 37  -1.500, "免費租還單車點", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -516.2, -253.92, 37  -2.000, "就業中心位於地圖市中心紫色舉手人偶", {210,20,204,250}, 1, 0.1, 0.1)
		-- 	sleep = false
		-- end	
		

		-- info jobs
		--info Cardealer
		if #(coords - vector3(-45.5, -1105.92, 27.26)) < 10.0 then
			Draw3DText(-45.5, -1105.92, 29.26 + 0.8, "🚗  車行  🚗", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText(-45.5, -1105.92, 29.26 + 0.4, "從事車輛出售、改裝 及 二手車賣買", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText(-45.5, -1105.92, 29.26 + 0.0, "如車行沒人，請F1手機發信息至 Cardealer", {255,255,255,255}, 1, 0.1, 0.1)
			sleep = false
		
		--info Restaurant
		-- elseif #(coords - vector3(-629.09, 244.51, 81.89)) < 10.0 then
		-- 	Draw3DText( -629.09, 244.51, 82.20, "🐏 一楽ラーメン 🐏", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -629.09, 244.51, 81.82, "從事食品出售 及 食物原材料收購", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( -629.09, 244.51, 81.59, "如果店內沒有員工在內，請F1手機發信息至 一楽ラーメン", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	sleep = false
		
		--info Mechanic
		elseif #(coords - vector3(818.28, -994.46, 26.21)) < 10.0 then
			Draw3DText( 818.28, -994.46, 26.21 - 1.650, "🛠車房\n從事外出修理服務 及 車輛用品出售", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( 818.28, -994.46, 26.21 - 2.450, "如果店內沒有員工在內，請F1手機發信息至 修車技工", {255,255,255,255}, 1, 0.1, 0.1)
			sleep = false
		
		--info Hospital
		elseif #(coords - vector3(vector3(296.96, -587.92, 45.26))) < 10.0 then
			sleep = false
			Draw3DText( 296.96, -587.92, 45.26 -1.200, "🏥彌敦道醫管局\n公務員單位", {255,255,255,255}, 0, 0.1, 0.1)
			Draw3DText( 296.96, -587.92, 45.26 -1.750, '服務範圍請查閱Discord:彌敦道醫管局 的 📢介紹.細則及條款 頻道', {255,255,255,255}, 5, 0.1, 0.1)
			Draw3DText( 296.96, -587.92, 45.26 -2.050, "外診治療服務可以按T輸入「/999ems」然後等候醫管局人員回覆「coming」", {255,255,255,255}, 6, 0.1, 0.1)
			Draw3DText( 296.96, -587.92, 45.26 -2.350, "死亡後請按G然後等候醫管局人員回覆「coming」", {255,255,255,255}, 6, 0.1, 0.1)
			-- Draw3DText( 299.25, -584.87, 46  -1.450, "公務員單位", {255,255,255,255}, 1, 0.1, 0.1)
		--info Hospital
		elseif #(coords - vector3(vector3(359.17, -586.46, 30.02))) < 10.0 then
			sleep = false
			Draw3DText( 359.17, -586.46, 30.02 - 1.200, "市民可到醫院上層櫃檯按「E」登記入住醫院", {255,255,255,255}, 0, 0.1, 0.1)
			Draw3DText( 359.17, -586.46, 30.02 - 1.750, '之後進入WARD A轉右右邊病房', {255,255,255,255}, 5, 0.1, 0.1)
			Draw3DText( 359.17, -586.46, 30.02 - 2.050, "走到病床旁邊按「E」躺在床上進行回血", {255,255,255,255}, 6, 0.1, 0.1)
			Draw3DText( 359.17, -586.46, 30.02 - 2.350, "完成回血後，系統會自動收費「$8000」，最後到櫃檯按「E」登記出院", {255,255,255,255}, 6, 0.1, 0.1)
			-- Draw3DText( 299.25, -584.87, 46  -1.450, "公務員單位", {255,255,255,255}, 1, 0.1, 0.1)
		
		--info Police
		elseif #(coords - vector3(434.5, -982.45, 30)) < 10.0 then
			Draw3DText( 434.5, -982.12, 33  -1.150, "👮彌敦道警務署", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( 434.5, -982.12, 33  -1.400, "公務員單位", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( 434.5, -982.12, 33  -1.630, '如要報案請F1手機發信息至 警察', {255,255,255,255}, 5, 0.1, 0.1)
			Draw3DText( 434.5, -982.12, 33  -1.900, "有意入職請查閱Discord👮警務部-招募版👮", {255,255,255,255}, 6, 0.1, 0.1)
			sleep = false
		
		--info Ammo
		-- if #(coords - vector3(822.0, -2147.76, 30)) < 40.0 then
		-- 	Draw3DText( 822.0, -2147.76, 32.7  -1.250, "⚔Y&N Logistic Incorporated⚔", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( 822.0, -2147.76, 32.7  -1.600, "從事軍火賣買 及 原材料收購", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	Draw3DText( 822.0, -2147.76, 32.7  -2.000, '如果店內沒有員工在內，請F1手機發信息至 軍火商', {255,255,255,255}, 5, 0.1, 0.1)
		-- end	
		
		--info car park central
		elseif #(coords - vector3(231.91, -798.44, 30.55)) < 5.0 then
			Draw3DText( 231.91, -798.44, 32  -0.300, "彌敦道 FIVEM\n中央停車場車庫", {255,255,255,255}, 1, 0.2, 0.2)
			-- Draw3DText( 231.91, -798.44, 32  -0.800, "中央停車場車庫", {255,255,255,255}, 1, 0.2, 0.2)
			sleep = false
		
		--info Labour
		elseif #(coords - vector3(-265.09, -963.58, 32)) < 50.0 then
			Draw3DText( -265.09, -963.58, 32  -0.300, "彌敦道 FIVEM\n勞工處\n此處按「E」查看職業。", {255,255,255,255}, 1, 0.2, 0.2)
			-- Draw3DText( -265.09, -963.58, 32  -0.800, "勞工處", {255,255,255,255}, 1, 0.2, 0.2)
			-- Draw3DText( -265.09, -963.58, 32  -1.250, "此處按「E」查看職業。", {255,255,255,255}, 1, 0.15, 0.15)
			sleep = false
		-- Government
		elseif #(coords - vector3(-292.8, -682.36, 33.17)) < 50.0 then
			Draw3DText( -292.8, -682.36, 33.17 -0.300, "🐽   豬欄辦事處 \n直屬政府部門\n", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( -292.8, -682.36, 33.17 -0.800, "服務範圍: 提供平台給予市民表達意見的渠道，拉近市民之間距離", {255,255,255,255}, 1, 0.1, 0.1)
			-- Draw3DText( -265.09, -963.58, 32  -1.250, "此處按「E」查看職業。", {255,255,255,255}, 1, 0.15, 0.15)
			sleep = false
		
		--info Detention city
		elseif #(coords - vector3(401.54, -1631.9, 30)) < 50.0 then
			Draw3DText( 401.54, -1631.9, 32  -0.300, "彌敦道 FIVEM\n市區載具扣押所\n", {255,255,255,255}, 1, 0.2, 0.2)
			-- Draw3DText( 401.54, -1631.9, 32  -0.800, "市區載具扣押所", {255,255,255,255}, 1, 0.2, 0.2)
			-- Draw3DText( 401.54, -1631.9, 32  -1.500, "此處按E進入選單", {255,255,255,255}, 1, 0.2, 0.2)
			sleep = false
		elseif #(coords - vector3(-591.46, -892.62, 25.94)) < 10.0 and ESX.PlayerData.job.name == 'chickenman'then
			Draw3DText( -591.46, -892.62, 25.94 -1.500, "用ALT賣雞肉", {255,255,255,255}, 1, 0.1, 0.1)
			sleep = false
		elseif #(coords - vector3(-97.37, -1014.39, 26.28)) < 10.0 then
			Draw3DText( -97.37, -1014.39, 26.28 -0.500, "用ALT賣素材", {255,255,255,255}, 1, 0.1, 0.1)
			sleep = false
		elseif #(coords - vector3(2831.39, 2796.61, 57.57)) < 20.0 then
			Draw3DText( 2831.39, 2796.61, 57.57 -0.500, "用ALT指向NPC(全程都是使用ALT的)，以開始工作\n然後都下面礦場開始工作", {255,255,255,255}, 1, 0.07, 0.07)
			Draw3DText( 2831.39, 2796.61, 57.57 -1.000, "每人開始工作後都會冷卻5分鐘後才可以再次開始工作", {255,255,255,255}, 1, 0.07, 0.07)
			sleep = false
		elseif #(coords - vector3(2953.32, 2749.96, 43.5)) < 50.0 then
			Draw3DText( 2953.32, 2749.96, 43.51 -0.500, "粉碎機", {255,255,255,255}, 1, 0.2, 0.2)
			sleep = false
		elseif #(coords - vector3(1084.94, -2002.62, 31.38)) < 50.0 then
			Draw3DText(1084.94, -2002.62, 31.38 -1.0, "精煉石頭", {255,255,255,255}, 1, 0.2, 0.2)
			sleep = false
		elseif #(coords - vector3(-622.62, -231.23, 38.06)) < 10.0 then
			Draw3DText(-622.62, -231.23, 38.06 -1.0, "用ALT訪問鑒定專家", {255,255,255,255}, 1, 0.07, 0.07)
			sleep = false
		end	
		
		--Spa franc info 
		-- if #(coords - vector3(4451.65, 7861.9, 89.5)) < 10.0 then
		-- 	Draw3DText( 4451.65, 7861.9, 89.5  -0.500, "[比利時斯帕賽道]\n租車信息\n除Toyota Camry外,所有租用車輛不得駛離賽車場", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	-- Draw3DText( 4451.65, 7861.9, 89.5  -0.750, "租車信息", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	-- Draw3DText( 4451.65, 7861.9, 89.5  -1.000, "除Toyota Camry外,所有租用車輛不得駛離賽車場", {255,255,255,255}, 1, 0.1, 0.1)
		-- 	sleep = false
		-- end	
		
		--Spa franc info 2
		if #(coords - vector3(4409.09, 7893.56, 90)) < 10.0 then
			Draw3DText( 4409.09, 7893.56, 90  -0.500, "[比利時斯帕賽道]", {255,255,255,255}, 1, 0.1, 0.1)
			Draw3DText( 4409.09, 7893.56, 90  -0.750, "安全信息", {0,255,0,255}, 1, 0.1, 0.1)
			Draw3DText( 4409.09, 7893.56, 90  -1.000, "進入賽道前務必觀察左右賽道環境", {255,255,0,255}, 1, 0.1, 0.1)
			sleep = false
		end	
		
		--Spa franc info 3
		if #(coords - vector3(4539.20, 7855.79, 87)) < 30.0 then
			Draw3DText( 4539.20, 7855.79, 90  -0.000, "[比利時斯帕賽道]", {255,255,255,255}, 1, 0.5, 0.5)
			Draw3DText( 4539.20, 7855.79, 90  -1.000, "安全信息", {0,255,0,255}, 1, 0.5, 0.5)
			Draw3DText( 4539.20, 7855.79, 90  -2.300, "進入維修站，限速100", {255,255,0,255}, 1, 0.5, 0.5)
			sleep = false
		end	
		
		--Spa franc info 3_1
		if #(coords - vector3(4429.03, 7933.25, 88)) < 30.0 then
			Draw3DText( 4429.03, 7933.25, 92  -0.000, "[比利時斯帕賽道]", {255,255,255,255}, 1, 0.5, 0.5)
			Draw3DText( 4429.03, 7933.25, 92  -1.000, "安全信息", {0,255,0,255}, 1, 0.5, 0.5)
			Draw3DText( 4429.03, 7933.25, 92  -2.300, "進入維修站，限速100", {255,0,0,255}, 1, 0.5, 0.5)
			sleep = false
		end	
		
		--Spa franc info 4
		if #(coords - vector3(4387.86, 7946.45, 91)) < 30.0 then
			Draw3DText( 4387.86, 7946.45, 94  -0.000, "[比利時斯帕賽道]", {255,255,255,255}, 1, 0.5, 0.5)
			Draw3DText( 4387.86, 7946.45, 94  -1.000, "安全信息", {0,255,0,255}, 1, 0.5, 0.5)
			Draw3DText( 4387.86, 7946.45, 94  -2.300, "維修站點 禁止停留", {255,255,0,255}, 1, 0.5, 0.5)
			sleep = false
		end	
		
		--Spa franc info 6
		if #(coords - vector3(4451.34, 7856.4, 88)) < 50.0 then
			Draw3DText( 4451.34, 7856.4, 90  -0.500, "[比利時斯帕賽道]", {255,255,255,255}, 1, 0.2, 0.2)
			Draw3DText( 4451.34, 7856.4, 90  -1.000, "出入口信息", {255,255,255,255}, 1, 0.2, 0.2)
			Draw3DText( 4451.34, 7856.4, 90  -1.500, "此出入口 禁止停留", {255,255,0,255}, 1, 0.2, 0.2)
			sleep = false
		end	

		-- Airport
		--Spa franc info 5
		if #(coords - vector3(-961.49, -3000.93, 13.95)) < 30.0 then
			Draw3DText( -961.49, -3000.93, 13.95 - 0.500, "[比利時斯帕賽道]", {255,255,255,255}, 1, 0.2, 0.2)
			-- Draw3DText( -961.49, -3000.93, 13.95 - 1.000, "不必怕跌落海底, 系統會偵查到你跌落海底, 然後傳送你回入口點", {255,255,255,255}, 1, 0.2, 0.2)
			Draw3DText( -961.49, -3000.93, 13.95 - 1.500, "此出入口 禁止停留", {255,255,0,255}, 1, 0.2, 0.2)
			sleep = false
		end	

		-- if #(coords - vector3(-972.08, -3020.74, 13.95)) < 50.0 then
		-- 	Draw3DText( -972.08, -3020.74, 13.95 - 0.500, "[秋名山賽道]", {255,255,255,255}, 1, 0.2, 0.2)
		-- 	-- Draw3DText( -972.08, -3020.74, 13.95 - 1.000, "不必怕跌落海底, 系統會偵查到你跌落海底, 然後傳送你回入口點", {255,255,255,255}, 1, 0.2, 0.2)
		-- 	Draw3DText( -972.08, -3020.74, 13.95 - 1.500, "此出入口 禁止停留", {255,255,0,255}, 1, 0.2, 0.2)
		-- 	sleep = false
		-- end

		if #(coords - vector3(-972.08, -3020.74, 13.95)) < 50.0 then
			Draw3DText( -972.08, -3020.74, 13.95 - 0.500, "[日本筑波賽道]", {255,255,255,255}, 1, 0.2, 0.2)
			-- Draw3DText( -972.08, -3020.74, 13.95 - 1.000, "不必怕跌落海底, 系統會偵查到你跌落海底, 然後傳送你回入口點", {255,255,255,255}, 1, 0.2, 0.2)
			Draw3DText( -972.08, -3020.74, 13.95 - 1.500, "此出入口 禁止停留", {255,255,0,255}, 1, 0.2, 0.2)
			sleep = false
		end

		if #(coords - vector3(-966.96, -3011.36, 13.95)) < 50.0 then
			Draw3DText( -966.96, -3011.36, 13.95 - 0.500, "[澳門東望洋賽道]", {255,255,255,255}, 1, 0.2, 0.2)
			-- Draw3DText( -966.96, -3011.36, 13.95 - 1.000, "不必怕跌落海底, 系統會偵查到你跌落海底, 然後傳送你回入口點", {255,255,255,255}, 1, 0.2, 0.2)
			Draw3DText( -966.96, -3011.36, 13.95 - 1.500, "此出入口 禁止停留", {255,255,0,255}, 1, 0.2, 0.2)
			sleep = false
		end

		if sleep then
			Wait(500)
		end
	end
end)

-- Draw3DText( -528.74, -232.24, 38  -2.000, "", {255,255,255,255}, 1, 0.1, 0.1)
-------------------------------------------------------------------------------------------------------------------------
function Draw3DText(x,y,z,textInput,colour,fontId,scaleX,scaleY)
	local px,py,pz=table.unpack(GetGameplayCamCoords())
	local dist = GetDistanceBetweenCoords(px,py,pz, x,y,z, 1)    
	local scale = (1/dist)*20
	local fov = (1/GetGameplayCamFov())*100
	local scale = scale*fov   
	SetTextScale(scaleX*scale, scaleY*scale)
	SetTextFont(fontId)
	SetTextProportional(1)
	local colourr,colourg,colourb,coloura = table.unpack(colour)
	SetTextColour(colourr,colourg,colourb, coloura)	
	SetTextDropshadow(1, 1, 1, 1, 255)
	SetTextEdge(2, 0, 0, 0, 150)
	SetTextDropShadow()
	SetTextOutline()
	SetTextEntry("STRING")
	SetTextCentre(1)
	AddTextComponentString(textInput)
	SetDrawOrigin(x,y,z+2, 0)
	DrawText(0.0, 0.0)
	ClearDrawOrigin()
end